<template>
  <div>
    <transition name="slide-fade">
      <div v-if="!show" id="UserBar" @click="tabHide" class="active">
        <div class="serviceagreement-main">
          <div v-if="type == 1">
             <h3 class="title">用户协议</h3>
            <h3 class="p">
              尊敬的用户，欢迎使用由浙江来回科技有限责任公司（以下简称“来回科技”）提供的服务。在使用前请您阅读如下服务协议，使用本应用即表示您同意接受本协议，本协议产生法律效力，特别涉及免除或者限制来回科技责任的条款，请仔细阅读。如有任何问题，可向客服咨询。
            </h3>
            <h3 class="p">1. 服务条款的确认和接受</h3>
            <h3 class="p">
              通过访问或使用本应用，表示用户同意接受本协议的所有条件和条款。
            </h3>
            <h3 class="p">2. 服务条款的变更和修改</h3>
            <h3 class="p">
              来回科技有权在必要时修改服务条款，服务条款一旦发生变更，将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以放弃获得的本应用信息服务。如果用户继续享用本应用的信息服务，则视为接受服务条款的变更。本应用保留随时修改或中断服务而不需要通知用户的权利。本应用行使修改或中断服务的权利，不需对用户或第三方负责。
            </h3>
            <h3 class="p">3. 用户行为</h3>
            <h3 class="p">3.1 用户账号、密码和安全</h3>
            <h3 class="p">
              用户一旦注册成功，便成为来回好运的合法用户，将得到一个密码和帐号。同时，此账号密码可登录来回好运的小程序。因此用户应采取合理措施维护其密码和帐号的安全。用户对利用该密码和帐号所进行的一切活动负全部责任；由该等活动所导致的任何损失或损害由用户承担，来回科技不承担任何责任。
              用户的密码和帐号遭到未授权的使用或发生其他任何安全问题，用户可以立即通知来回科技，并且用户在每次连线结束，应结束帐号使用，否则用户可能得不到来回科技的安全保护。对于用户长时间未使用的帐号，来回科技有权予以关闭并注销其内容。
            </h3>
            <h3 class="p">3.2 账号注册时的禁止行为</h3>
            <h3 class="p">
              （1）请勿以党和国家领导人或其他社会名人的真实姓名、字号、艺名、笔名注册；
            </h3>
            <h3 class="p">
              （2）冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关的名称；
            </h3>
            <h3 class="p">（3）请勿注册和其他网友之名相近、相仿的名字；</h3>
            <h3 class="p">
              （4）请勿注册不文明、不健康名字，或包含歧视、侮辱、猥亵类词语的名字；
            </h3>
            <h3 class="p">（5）请勿注册易产生歧义、引起他人误解的名字；</h3>
            <h3 class="p">3.3 用户在本应用上不得发布下列违法信息和照片：</h3>
            <h3 class="p">（1）反对宪法所确定的基本原则的；</h3>
            <h3 class="p">
              （2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            </h3>
            <h3 class="p">（3）损害国家荣誉和利益的；</h3>
            <h3 class="p">（4）煽动民族仇恨、民族歧视，破坏民族团结的；</h3>
            <h3 class="p">（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</h3>
            <h3 class="p">（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</h3>
            <h3 class="p">
              （7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
            </h3>
            <h3 class="p">（8）侮辱或者诽谤他人，侵害他人合法权益的；</h3>
            <h3 class="p">（9）含有法律、行政法规禁止的其他内容的；</h3>
            <h3 class="p">（10）禁止骚扰、毁谤、威胁、仿冒网站其他用户；</h3>
            <h3 class="p">
              （11）严禁煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；
            </h3>
            <h3 class="p">
              （12）严禁发布可能会妨害第三方权益的文件或者信息，例如（包括但不限于）：病毒代码、黑客程序、软件破解注册信息。
            </h3>
            <h3 class="p">
              （13）禁止上传他人作品。其中包括你从互联网上下载、截图或收集的他人的作品；
            </h3>
            <h3 class="p">（14）禁止上传广告、横幅、标志等网络图片；</h3>
            <h3 class="p">4. 上传或发布的内容</h3>
            <h3 class="p">
              用户上传的内容是指用户在来回好运小程序上传或发布的视频或其它任何形式的内容包括文字、图片、音频等。除非来回科技收到相关通知，否则来回科技将用户视为其在本应用上传或发布的内容的版权拥有人。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。来回科技不承担任何法律及连带责任。
              对于经由本应用而传送的内容，来回科技不保证前述其合法性、正当性、准确性、完整性或品质。用户在使用本应用时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，来回科技均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。来回科技有权（但无义务）自行拒绝或删除经由本应用提供的任何内容。
              个人或单位如认为来回科技存在侵犯自身合法权益的内容，应准备好具有法律效应的证明材料，及时与来回科技取得联系，以便来回科技迅速作出处理。
            </h3>
          </div>
          <div v-if="type == 2">
           <h3 class="title">隐私政策</h3>
            <h3 class="p">
              浙江来回科技有限公司尊重并保护用户隐私，我们将在本隐私政策里介绍应用如何处理敏感的用户数据和设备数据，包括应用如何收集、使用和分享用户数据。
            </h3>
            <h3 class="p">1.我们如何收集信息</h3>
            <h3 class="p">
              在你使用小程序服务的过程中，小程序会按照如下方式收集你在使用服务时主动提供或因为使用服务而产生的信息，用以向你提供服务、优化我们的服务以及保障你的帐号安全。
            </h3>
            <h3 class="p">
              1.1当你注册小程序账号、完善个人信息时，我们会收集你的手机号码、姓名、身份证号等信息，收集这些信息是为了帮助你完成小程序注册，保护你小程序帐号的安全。手机号码、姓名、身份证号等属于敏感信息，收集此类信息是为了满足相关法律法规的网络实名制要求。若你不提供这类信息，你将无法注册账号或不能使用我们提供的部分服务。你还可以根据自身需求选择用户头像等信息。
            </h3>
            <h3 class="p">
              1.2为了向您提供我们最核心的信息展示服务并向您推荐相关信息，我们会收集您的浏览记录（如您的关注、浏览）和点击操作记录（如点击、搜索、发布记录）。其中，
              您的浏览记录和点击操作记录属于个人敏感信息，但属于提供最核心的信息展示和信息发布服务所必需的信息。我们会以加密的方式存储，您也可以随时删除这些信息。
            </h3>
            <h3 class="p">
              1.3如您使用第三方平台的账号登录时，经过您明确授权账号绑定后，
              第三方平台会向我们同步您在该平台上使用的头像、昵称、地区（如有）、性别（如有），以使您可以直接登录并使用小程序。
            </h3>
            <h3 class="p">
              1.4当你使用小程序内的一键拨打电话时，我们会获取手机的电话权限，在获取这些权限前会动态申请权限，只有你允许了权限申请，小程序才会获取手机的电话权限，才能提供一键拨打功能。当然，如果拒绝了权限，将不能提供一键拨打电话功能，但是不影响你使用小程序的其它功能。
            </h3>
            <h3 class="p">
              1.5当你更换头像时，我们会获取手机的存储与相机权限，在获取这些权限前会动态申请权限，只有你允许了权限申请，小程序才会获取手机的存储权限与相机权限。
            </h3>
            <h3 class="p">
              1.6根据相关法律法规及国家标准，以下情形中，我们可能会收集、使用你的相关个人信息无需征求你的授权同意：
            </h3>
            <h3 class="p">
              1)与国家安全、国防安全等国家利益直接相关的；与公共安全、公共卫生、公众知情等重大公共利益直接相关的；
            </h3>
            <h3 class="p">2)与犯罪侦查、起诉、审判和判决执行等直接相关的；</h3>
            <h3 class="p">
              3)出于维护你或其他个人的生命、财产、声誉等重大合法权益但又很难得到本人同意的；
            </h3>
            <h3 class="p">4)所收集的个人信息是你自行向社会公众公开的；</h3>
            <h3 class="p">
              5)从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
            </h3>
            <h3 class="p">6)根据你要求签订和履行合同所必需的；</h3>
            <h3 class="p">
              7)用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
            </h3>
            <h3 class="p">8)为开展合法的新闻报道所必需的；</h3>
            <h3 class="p">
              9)出于公共利益开展统计或学术研究所必要，且其对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
            </h3>
            <h3 class="p">10)法律法规规定的其他情形。</h3>
            <h3 class="p">2.我们如何使用信息</h3>
            <h3 class="p">
              2.1向您提供服务，并根据您的情况和需求进行改进，以使我们的服务更能符合您的要求，从而使您得到更好的使用体验。
            </h3>
            <h3 class="p">
              2.2
              我们可能将通过某些功能所收集的信息用于我们的其他服务。例如，我们可能将你在使用我们某一功能或服务时收集的信息，在另一功能或服务中用于向你提供特定内容。
            </h3>
            <h3 class="p">
              2.3
              用于识别您的身份以及提供相应的物流运输服务，或用于保护您的合法权益。
            </h3>
            <h3 class="p">
              2.4
              为了确保服务的安全，帮助我们更好地了解我们应用程序的运行情况，我们可能记录相关信息，例如，你使用应用程序的频率、崩溃数据、总体使用情况、性能数据以及应用程序的来源。我们不会将我们存储在分析软件中的信息与你在应用程序中提供的任何个人身份信息相结合。
            </h3>
            <h3 class="p">
              2.5如我们使用你的个人信息，超出了与收集时所声称的目的及具有直接或合理关联的范围，我们将在使用你的个人信息前，再次向你告知并征得你的明示同意。
            </h3>
            <h3 class="p">3.我们如何共享信息</h3>
            <h3 class="p">
              我们不会出于第三方营销的目的提供、出售、出租、共享和交易您的个人信息，但为了向您提供服务并提升服务质量，您需同意共享我们收集到的您的信息。
            </h3>
            <h3 class="p">
              3.1我们不会对外公开披露其收集的个人信息，如必须公开披露时，我们会向你告知此次公开披露的目的、披露信息的类型及可能涉及的敏感信息，并征得你的明示同意。
            </h3>
            <h3 class="p">
              3.2.为方便您使用我们的服务及我们关联公司的服务，我们会向我们的关联公司共享您的个人信息。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。
            </h3>
            <h3 class="p">
              3.3为遵守适用的法律法规、诉讼目的或者行政机关、司法机构依法提出的要求而披露您的个人信息。如果我们确定您出现违反适用的法律法规或平台规则或相关协议的情况，或为保护我们及其关联公司或用户或公众的权利、财产或安全免遭损害，我们也可能披露关于您的信息，包括相关违规行为以及我们已对您采取的措施。
            </h3>
            <h3 class="p">
              3.4.经您授权许可的其他用途。只有您明确同意，我们才会共享您的姓名、手机号、身份证号、运输轨迹、磅单照片等信息。
            </h3>
            <h3 class="p">
              3.5
              随着我们业务的持续发展，我们有可能进行合并、收购、资产转让等交易，我们将告知你相关情形，按照法律法规及不低于本指引所要求的标准继续保护或要求新的控
              制者继续保护你的个人信息。
            </h3>
            <h3 class="p">
              另外，根据相关法律法规及国家标准，以下情形中，我们可能会共享、转让、公开披露个人信息无需事先征得个人信息主体的授权同意：
            </h3>
            <h3 class="p">1）与国家安全、国防安全直接相关的；</h3>
            <h3 class="p">2）与公共安全、公共卫生、重大公共利益直接相关的；</h3>
            <h3 class="p">3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</h3>
            <h3 class="p">
              4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
            </h3>
            <h3 class="p">5）个人信息主体自行向社会公众公开的个人信息；</h3>
            <h3 class="p">
              6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。
            </h3>
            <h3 class="p">4. 信息存储的期限</h3>
            <h3 class="p">
              一般而言，我们仅为实现目的所必需的时间保留你的个人信息，例如：
              手机号码：若你需要登录软件，我们需要一直保存你的手机号码，以保证你正常使用该服务，当你注销软件帐户后，我们将删除相应的信息；
              当我们的产品或服务发生停止运营的情形时，我们将以推送通知、公告等形式通知您，并在合理的期限内删除您的个人信息或进行匿名化处理。
            </h3>
            <h3 class="p">5. 您的个人信息保护</h3>
            <h3 class="p">
              账户信息是非常重要的个人信息，您将通过您注册软件时提供的密码来登录软件。如果您泄漏了密码，可能出现个人信息暴露的后果。因此，请您妥善保管您的账号和密码。
              我们有相应的安全措施来确保用户的信息不发生丢失，滥用的情况。但是信息在网络上传输和存储没有绝对的安全。如您发现自己的账号有异常情况，尤其是您的账户或密码发生泄露，您应该立即拨打客服电话与我们取得联系，以便我们采取相应措施。
            </h3>
            <h3 class="p">6.未成年人保护</h3>
            <h3 class="p">
              如您为未成年人，请您在您的监护人已经仔细阅读本隐私政策，并在征得您的监护人同意的前提下使用我们的服务。
            </h3>
            <h3 class="p">7.变更</h3>
            <h3 class="p">
              我们可能会适时对本隐私政策进行修订，变更后的隐私政策将于生效前在平台公告或以其他适当方式通知您。在此情况下，若您继续使用我们的服务，即表示同意接受变更后的隐私政策的约束。
            </h3>
          </div>
        </div>
      </div>
    </transition>
  </div>
</template>
<script>
export default {
  data() {
    return {}
  },
  props: ['show', 'type'],
  computed: {},
  watch: {
    show(value) {
      console.log(value)
    }
  },
  methods: {
    tabHide() {
      this.$emit('hideFade', this.show)
    },
  },
}
</script>
<style lang="scss">
#UserBar {
  position: fixed;
  z-index: 100;
  width: 100%;
  height: 100vh;
  top: 0;
  background-color: #fff;
  overflow: scroll;
  .serviceagreement-main {
    width: 80%;
    margin: 20px 10%;
    height: 100%;
    line-height: 0.25rem;
    h3 {
      text-align: center;
    }
    .p{
  width:100%;
  line-height:.25rem;
  font-size:.13rem;
  color:#000;
  margin:.1rem 0 0;
  text-indent:.1rem;
}
  }
}

.slide-fade-enter-active {
  transition: all 0.5s ease;
}
.slide-fade-leave-active {
  transition: all 0.5s cubic-bezier(1, 0.5, 0.8, 1);
}
.slide-fade-enter, .slide-fade-leave-to
    /* .slide-fade-leave-active for below version 2.1.8 */ {
  transform: translate3d(100%, 0, 0);
  opacity: 0;
}
</style>
